Autodesk.Revit.DB.Infrastructure.IAlignmentServer.GetOrCreateDefaultLabelSetType(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get the type with default settings for creating a label set.
If one does not exist, create it.
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServer.SetInSessionDefaultLabelSetTypeId(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Set in-session default type for label set creation
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServer.GetInSessionDefaultLabelSetTypeId(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get in-session default type for label set creation
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServer.GetValuesByStation(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get distance and point on geometry by station
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServer.GetValuesByPoint(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get distance, station value and point on geometry by point
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServer.GetValuesByDistance(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get station value and point on geometry by alignment distance
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServer
Interface class for external servers implementing Infrastructure Alignments
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.
Since:
2021